sterentev/atdf-device-asm-include/inc/ATtiny25.inc
; ----------	Register MCUSR bits		------------------------
.equ	WDRF		= 3		; 0x08 - Watchdog Reset Flag
.equ	BORF		= 2		; 0x04 - Brown-out Reset Flag
.equ	EXTRF		= 1		; 0x02 - External Reset Flag
.equ	PORF		= 0		; 0x01 - Power-On Reset Flag

; ----------	Register OSCCAL bits		------------------------
.equ	OSCCAL_MASK	= 0xFF		;      - Oscillator Calibration (8 bits)
.equ	OSCCAL0		= 0		;          OSCCAL BIT0 position

; ----------	Register CLKPR bits		------------------------
.equ	CLKPCE		= 7		; 0x80 - Clock Prescaler Change Enable
.equ	CLKPS_MASK	= 0x0F		;      - Clock Prescaler Select Bits (4 bits)
.equ	CLKPS0		= 0		;          CLKPS BIT0 position
; ::::  CLKPS	:::: bitfield values
;			0x00		; 1
;			0x01		; 2
;			0x02		; 4
;			0x03		; 8
;			0x04		; 16
;			0x05		; 32
;			0x06		; 64
;			0x07		; 128
;			0x08		; 256

; ----------	Register PLLCSR bits		------------------------
.equ	LSM		= 7		; 0x80 - Low speed mode
.equ	PCKE		= 2		; 0x04 - PCK Enable
.equ	PLLE		= 1		; 0x02 - PLL Enable
.equ	PLOCK		= 0		; 0x01 - PLL Lock detector




; **********************************************************************
; ***************	EXTRA BITFIELDS VALUES	************************
; **********************************************************************
;
; ::::  INTERRUPT_SENSE_CONTROL	:::: values
;			0b00		; Low Level of INTX
;			0b01		; Any Logical Change on INTX
;			0b10		; Falling Edge of INTX
;			0b11		; Rising Edge of INTX



; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 15
.equ	INT_VECTORS_SIZE	= 0x1E
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Pin, Power-on Reset, Brown-out Reset,Watchdog Reset
;	1	INT0		; External Interrupt 0
;	2	PCINT0		; Pin change Interrupt Request 0
;	3	TIMER1_COMPA	; Timer/Counter1 Compare Match 1A
;	4	TIMER1_OVF	; Timer/Counter1 Overflow
;	5	TIMER0_OVF	; Timer/Counter0 Overflow
;	6	EE_RDY		; EEPROM Ready
;	7	ANA_COMP	; Analog comparator
;	8	ADC		; ADC Conversion ready
;	9	TIMER1_COMPB	; Timer/Counter1 Compare Match B
;	10	TIMER0_COMPA	; Timer/Counter0 Compare Match A
;	11	TIMER0_COMPB	; Timer/Counter0 Compare Match B
;	12	WDT		; Watchdog Time-out
;	13	USI_START	; USI START
;	14	USI_OVF		; USI Overflow


; ====	ASM PROGRAM SKELETON				========
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	INT_RESET	; RESET		 - External Pin, Power-on Reset, Brown-out Reset,Watchdog Reset
;#		rjmp	INT_INT0	; INT0		 - External Interrupt 0
;#		rjmp	INT_PCINT0	; PCINT0	 - Pin change Interrupt Request 0
;#		reti			; TIMER1_COMPA	 - Timer/Counter1 Compare Match 1A
;#		reti			; TIMER1_OVF	 - Timer/Counter1 Overflow
;#		reti			; TIMER0_OVF	 - Timer/Counter0 Overflow
;#		rjmp	INT_EE_RDY	; EE_RDY	 - EEPROM Ready
;#		reti			; ANA_COMP	 - Analog comparator
;#		reti			; ADC		 - ADC Conversion ready
;#		reti			; TIMER1_COMPB	 - Timer/Counter1 Compare Match B
;#		reti			; TIMER0_COMPA	 - Timer/Counter0 Compare Match A
;#		reti			; TIMER0_COMPB	 - Timer/Counter0 Compare Match B
;#		reti			; WDT		 - Watchdog Time-out
;#		reti			; USI_START	 - USI START
;#		reti			; USI_OVF	 - USI Overflow
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	INT_RESET:
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATTINY25_INC_ */

; ************************ END OF FILE *********************************

